# MEPFamilyConnectorInfo Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPFamilyConnectorInfo Methods
MEPFamilyConnectorInfo Class See Also
---
The MEPFamilyConnectorInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from MEPConnectorInfo.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetAssociateFamilyParameterId | Gets the associate family parameter id of the specified connector parameter id. |
| GetConnectorParameterValue | Gets the parameter value of the specified connector parameter id. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
MEPFamilyConnectorInfo Class
Autodesk.Revit.DB Namespace